Revit 2027 API
FormUtils.DissolveForms(Document, ICollection<ElementId>) Method
 Dissolves a collection of form elements into their defining elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> DissolveForms(
	Document ADoc,
	ICollection<ElementId> elements
)
Public Shared Function DissolveForms (
	ADoc As Document,
	elements As ICollection(Of ElementId)
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ DissolveForms(
	Document^ ADoc,
	ICollection<ElementId^>^ elements
)
static member DissolveForms :
        ADoc : Document *
        elements : ICollection<ElementId> -> ICollection<ElementId>
Parameters
ADoc Document
 The document
elements ICollection<ElementId>
 A collection of element IDs of Forms and GeomCombinations that contain Forms that will be dissolved.
Return Value
ICollection<ElementId>
 A collection of curve element ids from the profiles and paths of the dissolved forms.
Exceptions
Exception | Condition
ArgumentException |  The elements do not include Forms that can be dissolved.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FormUtils Class
DissolveForms Overload
Autodesk.Revit.DB Namespace